constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       95560;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       95760;
    }
    bottom
    {
        type            patch;
        nFaces          80;
        startFace       95960;
    }
    top
    {
        type            patch;
        nFaces          80;
        startFace       96040;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       96120;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          96000;
        startFace       96440;
    }
)

// ************************************************************************* //
